// priority: 1000

global.zh_cn_PlayerLogging_Message = [
  {
    text: "§e感到卡顿？请在内存占用较高时使用§6R§e键菜单中的§6释放内存§e按钮手动清理内存！"
  },
  {
    text: "§e感谢游玩贪婪整合包！如果你在游戏中遇到了问题，请先查阅§6《贪婪整合包——从入门到精通》。"
  },
  {
    text: "§e如果你遇到了模组相关的问题，请查阅§6百科全书§e！模组的指导手册都可以在这里找到。"
  },
  {
    text: "§e本整合附带了大量的音乐和改进的音效，强烈推荐佩戴耳机游玩！"
  },
  {
    text: "§e你可以在任务菜单中切换游戏模式！任务菜单可以在物品栏界面的左上角找到。"
  },
  {
    text: "§e你可以在进入游戏前就调整游戏模式！游戏模式的配置文件位于config/greedycraft/config.json，修改packmode后面的内容就可以改变游戏模式！"
  },
  {
    text: "§e你可以使用/greedycraft命令来切换整合包模式和显示或隐藏计分板。"
  },
  {
    text: "§e如果遇到了背景音乐长时间停止播放的问题，你可以按Alt+小键盘上的-来重载动态音乐！"
  },
  {
    text: "§e如果感到卡顿，请尝试按§eR§6打开菜单并点击“§6清理内存§e”按钮。另外也可以试试调整下视距再调回来。"
  },
  {
    text: "§e你可以使用§6/hidedeathquotes§e指令来关闭死亡信息显示，或§6/showdeathquotes§e重新打开死亡信息显示！"
  },
  {
    text: "§e你可以使用§6/backup§e指令手动备份世界，在世界选择界面可以找到恢复备份的选项！"
  },
  {
    text: "§e按§6B§e键可以在你的位置新建路径点，在大地图界面按§6B§e可以在鼠标位置新建路径点！"
  },
  {
    text: "§e更新整合包版本时，将之前整合包根目录下的§6saves§e文件夹挪到新版本的相同位置即可保留存档！"
  }
]

global.zh_cn_StagesUnlock_Message = {
  init: {
    title: ["§e§l欢迎来到贪婪整合包！"],
    lore: ["§a§o§n从现在开始体验游戏！"],
    unlock: ["§d§l可从 '进度' 页面查看游戏阶段树"]
  },
  getting_started: {
    title: ["§e§l初出茅庐"],
    lore: ["§a§o§n冒险的黎明"],
    unlock: [
      "§d各种工具与武器",
      "§d§l工作台与木制品"
    ]
  },
  twilight_forest: {
    title: ["§a§l暮色探险家"],
    lore: ["§e§o§n欢迎来到暮色森林！"],
    unlock: ["§c§l难度有些许提升"]
  },
  twilight_shield: {
    title: ["§d§l暮色庇护"],
    lore: ["§9§o§n再也不用惧怕地狱的炎热了！"],
    unlock: ["§e§l可以进入下界"]
  },
  nether: {
    title: ["§4§l地心深处"],
    lore: ["§6§o§n欢迎来到充满宝藏的炼狱！"],
    unlock: [
      "§d§l各种下界专属物品",
      "§d§l怪物现在会拥有更强力的盔甲和武器",
      "§d§l可以进入天境"
    ]
  },
  gaia_killer: {
    title: ["§d§l盖亚杀手"],
    lore: ["§e§o§n我想你准备好更进一步了"],
    unlock: ["§c§l可以挑战凋零"]
  },
  wither_killer: {
    title: ["§e§l凋零杀手"],
    lore: [
      "§5§o§n邪恶的灵魂已被击败，世界终于从凋零的命运中逃脱...",
      "§c§o§n§l终末之地的巨龙正在凝视着你的一举一动。"
    ],
    unlock: [
      "§a§l使用下界之星制作的物品",
      "§a§l可以制作防凋零方块",
      "§a§l可以制作末影护符"
    ]
  },
  fearless_man: {
    title: ["§b§l勇气可嘉"],
    lore: ["§6§o§n在与女武神的较量中，你已经证明了你的实力，你现在可以抵抗深谙之园的黑暗侵蚀了。"],
    unlock: [
      "§a§l可以制作深园催化石",
      "§a§l可以进入深谙之园"
    ]
  },
}